{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 28, 28, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "activation": "relu", "filters": 32, "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "padding": "valid", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "trainable": true, "kernel_size": [3, 3], "use_bias": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "seed": null, "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "activation": "softmax", "trainable": true, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null}}], "keras_version": "2.1.3", "backend": "tensorflow"}